In [1]:
import pandas as pd

# Sample dataset
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],
    "Age": [23, 35, 30, 40, 22, 29, 31, 28],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Finance", "HR"],
    "Salary": [50000, 60000, 58000, 72000, 48000, 54000, 62000, 51000]
}

df = pd.DataFrame(data, index=["E1", "E2", "E3", "E4", "E5", "E6", "E7", "E8"])
df

       Name  Age Department  Salary
E1    Alice   23         HR   50000
E2      Bob   35         IT   60000
E3  Charlie   30    Finance   58000
E4    David   40         IT   72000
E5      Eva   22         HR   48000
E6    Frank   29    Finance   54000
E7    Grace   31    Finance   62000
E8   Hannah   28         HR   51000

In [9]:

# Part 1:

# 1. Select the row with index 'E3'
# 2. Select the Name and Salary columns for employee 'E2'
# 3. Select rows from 'E4' to 'E6' (inclusive) and show only the Name and Department columns
# 4. Select all employees except the one with index 'E5'
df.loc['E3']
df.loc['E2', ['Name', 'Salary']]
df.loc['E4':'E6', ['Name', 'Department']]
df.drop('E5')

       Name  Age Department  Salary
E1    Alice   23         HR   50000
E2      Bob   35         IT   60000
E3  Charlie   30    Finance   58000
E4    David   40         IT   72000
E6    Frank   29    Finance   54000
E7    Grace   31    Finance   62000
E8   Hannah   28         HR   51000

In [22]:

# Part 2:

# 5. Select all employees whose Age is greater than 30
# 6. Select the Name and Salary of employees who work in the Finance department
# 7. Select all employees whose Salary is between 50,000 and 60,000 (inclusive)
# 8. Select all employees who are in the HR department AND have Age < 25
# 9. Select the Department and Salary of employees whose Name starts with 'A' or 'E'
df.loc[df['Age'] > 30]
df.loc[df['Department'] == 'Finance', ['Name', 'Salary']]
df.loc[df['Salary'].between(50000, 60000)]
df.loc[(df['Department'] == 'HR') & (df['Age'] < 25)]
df.loc[df['Name'].str.startswith(('A', 'E')), ['Department', 'Salary']]

   Department  Salary
E1         HR   50000
E5         HR   48000

In [26]:

# Part 3:
# 10. Write one `.loc[]` expression that returns the Name and Department of employees who:
# - Earn more than 55,000, AND
# - Do not work in the IT department
df.loc[(df['Salary'] > 55000) & (df['Department'] != 'IT'), ['Name', 'Department']]

       Name Department
E3  Charlie    Finance
E7    Grace    Finance

In [59]:

# Extra Tasks

# 11. Select all employees who work in either HR or Finance departments
# 12. Select the Name of employees who have an Age exactly equal to 29 or 31
# 13. Select the Salary of employees whose index is either 'E1', 'E5', or 'E8'
# 14. Select rows for employees with indexes from 'E2' through 'E7', only showing Age and Salary
# 15. Select all employees whose Salary is NOT greater than 55,000 # TODO: Используйте знак "~" перед булеан выражением в .loc, чтобы сделать обратное неравенство (если "не")
# 16. Select the Name and Department of employees who have Age between 25 and 35 (inclusive)
# 17. Select all employees whose Name contains the letter 'a' (case insensitive) # TODO: Используйте метод типа данных стринг с названием ".find()"
# 18. Select the Salary of employees who do not work in the HR department
# 19. Select all employees whose Age is an even number # TODO: Для этой проверки проверяйте остаток от деления на два. Напоминаю, узнать остток от деления можно с помощью знака "%"
# 20. Select the Name and Salary of employees whose Salary is higher than the average Salary # TODO: Используйте метод обьекта Series ".mean()", чтобы узнать среднее значение
df.loc[df['Department'].isin(['HR', 'Finance'])]
df.loc[df['Age'].isin([29, 31]), ['Name']]
df.loc[df.index.isin(['E1', 'E5', 'E8']), ['Salary']]
df.loc['E2':'E7', ['Age', 'Salary']]
df.loc[~(df['Salary'] > 55000)]
df.loc[df.Age.between(25, 35), ['Name', 'Department']]
df.loc[df.Name.str.lower().str.find('a') != -1]
df.loc[~(df.Department == 'HR'), ['Salary']]
df.loc[df.Age % 2 == 0]
df.loc[df.Salary > df.Salary.mean(), ['Name', 'Salary']]

       Name  Salary
E2      Bob   60000
E3  Charlie   58000
E4    David   72000
E7    Grace   62000